system/modules/july/message/seeds/MessageFieldSeeder.php

    public static function afterSeeding()
    {
        foreach (MessageField::all() as $field) {
---
select * from "message_fields"