system/modules/july/node/src/Controllers/NodeController.php

    public function index()
    {
        $data = [
            'models' => Node::indexWith(['url'])->all(),
            'context' => [
                'molds' => NodeType::query()->pluck('label', 'id')->all(),
                'catalogs' => Catalog::query()->pluck('label', 'id')->all(),
                'languages' => Lang::getTranslatableLangnames(),
            ],
---
select "label", "id" from "node_types"
select "label", "id" from "catalogs"

    public function chooseMold()
    {
        $data = [
            'models' => NodeType::all()->all(),
        ];
---
select * from "node_types"

    public function create(NodeType $nodeType)
    {
        // 节点模板数据
        $model = array_merge(Node::template(), $nodeType->getFieldValues());
        $model['langcode'] = langcode('content');
        $model['mold_id'] = $nodeType->getKey();

        // 字段集，按是否全局字段分组
        $fields = $nodeType->getFields()->groupBy(function(NodeField $field) {
            return $field->is_global ? 'global' : 'local';
        });

        $data = [
            'model' => $model,
            'context' => [
                'mold' => $nodeType,
                'global_fields' => $fields->get('global', []),
                'local_fields' => $fields->get('local', []),
                'views' => Node::query()->pluck('view')->filter()->unique()->all(),
---
select "view" from "nodes"

    public function edit(Node $node, string $langcode = null)
    {
        if ($langcode) {
            $node->translateTo($langcode);
        }

        // 字段集，按是否全局字段分组
        $fields = $node->getFields()->groupBy(function(NodeField $field) {
            return $field->is_global ? 'global' : 'local';
        });

        $data = [
            'model' => array_merge($node->gather(), ['langcode' => $node->getLangcode()]),
            'context' => [
                'mold' => $node->mold,
                'global_fields' => $fields->get('global'),
                'local_fields' => $fields->get('local'),
                'views' => Node::query()->pluck('view')->filter()->unique()->all(),
---
select "view" from "nodes"