system/modules/july/node/seeds/NodeFieldSeeder.php

    public static function afterSeeding()
    {
        foreach (NodeField::all() as $field) {
---
select * from "node_fields"