system/app/Entity/TranslatableEntityBase.php

select * from "node_translations" where "node_translations"."entity_id" = 1 and "node_translations"."entity_id" is not null and ("entity_id" = 1 and "langcode" = 'zh') limit 1
---
    public function update(array $attributes = [], array $options = [])
    {
        if (! $this->exists) {
            return false;
        }

        if ($this->isTranslated()) {
            $attributes = Arr::except($attributes, ['id', 'entity_id', 'langcode']);
            $this->translations()->updateOrCreate([
                'entity_id' => $this->getKey(),
                'langcode' => $this->getLangcode(),
            ], $attributes);

select * from "node_translations" where "node_translations"."entity_id" = 1 and "node_translations"."entity_id" is not null and "langcode" = 'zh' limit 1
---
    public function getTranslation()
    {
        return $this->translations()->where('langcode', $this->getLangcode())->first();