system/modules/july/node/src/Catalog.php

    public function getPositions()
    {
        $positions = [];
        foreach (CatalogNode::ofCatalog($this)->get() as $position) {
---
select * from "catalog_node" where "catalog_id" = 'main'